xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
/**
*   @file    Adc_Adc12bsarv2_Irq.c
*   @version 1.0.1
*
*   @brief   AUTOSAR Adc - ADC12BSARV2 Interrupt source file.
*   @details  Autosar Adc Interrupt source file.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.3 MCAL
*   Platform             : ARM
*   Peripheral           : ADC12BSARV2
*   Dependencies         : none
*
*   Autosar Version      : 4.3.1
*   Autosar Revision     : ASR_REL_4_3_REV_0001
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_3_REV_0001_20190621
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2019 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Adc_Adc12bsarv2_Irq_c_REF_1
* Violates MISRA 2004 Advisory Rule 19.1, only preprocessor statements and comments before "#include"
* This violation is not fixed since the inclusion of MemMap.h is as per Autosar requirement.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_3
* Violates MISRA 2004 Advisory Rule 11.3, A cast should not be performed between a pointer type and
* an integral type.
* The cast is used to access memory mapped registers.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h.
* There are different kinds of execution code sections.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_4
* Violates MISRA 2004 Required Rule 14.7, Return statement before end of function.
* The return statement are used to simplify the code structure and easier readability.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_7
* Violates MISRA 2004 Required Rule 1.4,
* The compiler/linker shall be checked to ensure that 31 character significance and case
* sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have a file version check.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_8
* Violates MISRA 2004 Required Rule 17.4, Array indexing shall be the only allowed form of pointer
* arithmetic but used due to the code complexity.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_9
* Violates MISRA 2004 Required Rule 11.1, cast from unsigned int to pointer. This macro compute the
* address of any register by using the hardware ofsset of the controller. The address calculated as an
* unsigned int is passed to a amcro for initializing the pointer with that address.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_11
* Violates MISRA 2004 Required Rule 8.10, all declarations and definitions of objects or functions
* at file scope shall have internal linkage unless external linkage is required.
* This violation occurs because of the interaction with MCL module or because of  ISR symbols that
* need to be exported
*
* @section Adc_Adc12bsarv2_Irq_c_REF_12
* Violates MISRA 2004 Required Rule 8.8, An external object or function shall be declared
* in one and only one file.
* This violation cannot be removed due to the interaction with MCL module.
*
* @section Adc_Adc12bsarv2_Irq_c_REF_13
* Violates MISRA 2004 Required Rule 10.3, Cast from unsign interger to sign interger
* This is used for calculate the dma source/destination last
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. All compilers used support more than 31 chars for
* identifiers.
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this Unit
==================================================================================================*/
#include "Adc_Ipw.h"
#ifndef USER_MODE_REG_PROT_ENABLED
#define USER_MODE_REG_PROT_ENABLED                (ADC_USER_MODE_REG_PROT_ENABLED)
#endif
#include "SilRegMacros.h"
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_2 Repeated include file  */
#include "Mcal.h"
#include "SchM_Adc.h"

#ifdef ADC_DMA_SUPPORTED
#include "CDD_Mcl.h"
#endif

#include "Adc_Pdb.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define ADC_AR_VENDOR_ID_ADC12BSARV2_IRQ_C                 43
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C     4
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C     3
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_IRQ_C  1
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_SW_MAJOR_VERSION_ADC12BSARV2_IRQ_C             1
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_SW_MINOR_VERSION_ADC12BSARV2_IRQ_C             0
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#define ADC_SW_PATCH_VERSION_ADC12BSARV2_IRQ_C             1

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/

