xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
/* Check if source file and ADC IPW header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_IRQ_C != ADC_VENDOR_ID_IPW_H)
    #error "Adc_Adc12bsarv2_Irq.c and Adc_Ipw.h have different vendor ids"
#endif

/* Check if source file and ADC IPW header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_MAJOR_VERSION_IPW_H) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_MINOR_VERSION_IPW_H) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_REVISION_VERSION_IPW_H) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and Adc_Ipw.h are different"
#endif

/* Check if source file and ADC IPW header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_MAJOR_VERSION_IPW_H) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_MINOR_VERSION_IPW_H) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_PATCH_VERSION_IPW_H) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2_Irq.c and Adc_Ipw.h are different"
#endif

/* Check if source file and Adc_Pdb header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_IRQ_C != ADC_VENDOR_ID_PDB)
    #error "Adc_Adc12bsarv2_Irq.c and Adc_Pdb.h have different vendor ids"
#endif

/* Check if source file and Adc_Pdb header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_MAJOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_MINOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_IRQ_C != ADC_AR_RELEASE_REVISION_VERSION_PDB) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and Adc_Pdb.h are different"
#endif

/* Check if source file and Adc_Pdb header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_MAJOR_VERSION_PDB) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_MINOR_VERSION_PDB) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_IRQ_C != ADC_SW_PATCH_VERSION_PDB) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2_Irq.c and Adc_Pdb.h are different"
#endif
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
/* Check if source file and SilRegMacros header file are of the same version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != SILREGMACROS_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != SILREGMACROS_AR_RELEASE_MINOR_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and SilRegMacros.h are different"
#endif

/* Check if source file and Mcal header file are of the same version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != MCAL_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != MCAL_AR_RELEASE_MINOR_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and Mcal.h are different"
#endif


#ifdef ADC_DMA_SUPPORTED
/* Check if source file and CDD_Mcl header file are of the same version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != MCL_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != MCL_AR_RELEASE_MINOR_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and CDD_Mcl.h are different"
#endif

/* Check if source file and Mcl_Types header file are of the same version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_IRQ_C != MCL_TYPES_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_IRQ_C != MCL_TYPES_AR_RELEASE_MINOR_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2_Irq.c and Mcl_Types.h are different"
#endif

#endif /* ADC_DMA_SUPPORTED */

#endif /* DISABLE_MCAL_INTERMODULE_ASR_CHECK */

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

#define ADC_START_SEC_CODE
/**
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_2 Repeated include file MemMap.h
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_1 only preprocessor statements and comments before "#include"
*/
#include "Adc_MemMap.h"

