xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
#ifdef ADC_UNIT_0_ISR_USED
ISR(Adc_Adc12bsarv2_EndGroupConvUnit0);
#endif

#ifdef ADC_UNIT_1_ISR_USED
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
ISR(Adc_Adc12bsarv2_EndGroupConvUnit1);
#endif

#ifdef ADC_DMA_SUPPORTED
#ifdef ADC_UNIT_0
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_12 Function decalration */
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaTransferComplete0(void);
#endif /* ADC_UNIT_0 */
#ifdef ADC_UNIT_1
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash */
/** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_12 Function decalration */
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaTransferComplete1(void);
#endif /* ADC_UNIT_1 */
#endif /* ADC_DMA_SUPPORTED */

#if ((defined(ADC_UNIT_0_ISR_USED)) || (defined(ADC_UNIT_1_ISR_USED)))
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndGroupConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bNormalconversion
);
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_CheckPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
);
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_HwSwCheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateLimitCheckFailed
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(uint8, AUTOMATIC) u8NumChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(boolean, AUTOMATIC) bNormalconversion
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StopConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_RestartContinuousConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateSoftwareGroupState
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
);
#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateHardwareGroupState
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
);
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#endif /* ((defined(ADC_UNIT_0_ISR_USED)) || (defined(ADC_UNIT_1_ISR_USED))) */

#ifdef ADC_DMA_SUPPORTED
#if defined(ADC_UNIT_0) || defined(ADC_UNIT_1)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndGroupConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndDmaPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bSoftwareConversion
);
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaCheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndNormalConv
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StopDmaAndConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel
);
#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndHardwareConv
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaUpdateDaddr
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
LOCAL_INLINE FUNC (Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_TransferToInternalBuffer
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateDmaLimitCheckFailed
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger
);
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#endif /* defined(ADC_UNIT_0) || defined(ADC_UNIT_1) */
#endif /* ADC_DMA_SUPPORTED */

#if ((defined(ADC_UNIT_0_ISR_USED)) || (defined(ADC_UNIT_1_ISR_USED)) || (defined(ADC_DMA_SUPPORTED)))
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
LOCAL_INLINE FUNC(boolean, ADC_CODE) Adc_Adc12bsarv2_CheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateQueue
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#endif

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
#if ((defined(ADC_UNIT_0_ISR_USED)) || (defined(ADC_UNIT_1_ISR_USED)))
/**
* @brief          This function handles the ISR for the conversion.
* @details        The function handles the ISR for the given hardware Unit.
*                 It's used on both ADC Hardware units.
*
* @param[in]      Unit        the current HW Unit.
*
* @return         void
*
* @api
* @implements     Adc_Adc12bsarv2_EndGroupConversion_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndGroupConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(uint8, AUTOMATIC) u8ResultReg;
    VAR(uint32, AUTOMATIC) u32SC1Value = 0UL;
    VAR(boolean, AUTOMATIC) bIsSpurious = (boolean)TRUE;
    VAR(boolean, AUTOMATIC) bLastChannel = (boolean)FALSE;

    /* Check if conversion complete interrupt of the last channel to indicate end of chain complete */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    for(u8ResultReg = 0U; u8ResultReg < Adc_aUnitStatus[Unit].u8Sc1Used; u8ResultReg++)
    {
        /* Read SC1n registers */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer. */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        u32SC1Value = REG_READ32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8ResultReg));

        /* Check COCO bit in SC1 for all channels and interrupt enable bit for last channel*/
        if(0UL == (u32SC1Value & ADC12BSARV2_SC1n_CONV_COMPLETE_U32))
        {
            break;
        }
        else if ((ADC12BSARV2_CONV_COMPLETE_INT_EN_U32 == (u32SC1Value & ADC12BSARV2_CONV_COMPLETE_INT_EN_U32)))
        {
            /* Interrupt enable bit and COCO enable bit in SC1, finding the last channel */
            bLastChannel = (boolean)TRUE;
        }
        else
        {
            /* Nothing for misra */
        }
    }

