xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
    if(NULL_PTR != Adc_pCfgPtr)
    {
        if ((boolean)TRUE == bLastChannel)
        {
#if (ADC_HW_TRIGGER_API == STD_ON)
            /* Check if requests are available in queue */
            if (Adc_aUnitStatus[Unit].HwNormalQueueIndex > (Adc_QueueIndexType)0)
            {
                Adc_Adc12bsarv2_EndPartialConversion(Unit, Adc_aUnitStatus[Unit].HwNormalQueue[0], (boolean)FALSE);

                /* Interrupt is not spurious */
                bIsSpurious = (boolean)FALSE;
            }
            else
#endif
            if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0)
            {
                Adc_Adc12bsarv2_EndPartialConversion(Unit, Adc_aUnitStatus[Unit].SwNormalQueue[0], (boolean)TRUE);

                /* Interrupt is not spurious */
                bIsSpurious = (boolean)FALSE;
            }

#if (ADC_HW_TRIGGER_API == STD_ON)
            else
            {
                /* do nothing for misra */
            }
#endif
        }
    }

    /* If there is no flag enabled, it's a spurious interrupt */
    /* Clear all of COCO flag by reading Rn registers */
    if(((boolean)TRUE == bIsSpurious) || ((boolean)FALSE == bLastChannel))
    {
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        for(u8ResultReg = 0U; u8ResultReg < ADC_NUM_SC1n_REGISTER; u8ResultReg++)
        {
            /* ADC078 */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer. */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8ResultReg));
        }
    }
}

/**
* @brief          This function handles the normal conversion ending.
* @details        When a normal (not injected) conversion ends, and the end of
*                 conversion ISR is called, this function takes care about the
*                 driver and the module state transitions.
*
* @param[in]      Unit        the current HW Unit.
*
* @return         void
*
* @api
* @implements     Adc_Adc12bsarv2_EndPartialConversion_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bNormalconversion
)
{
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    VAR(Adc_ChannelIndexType, AUTOMATIC) NumChannel;
    VAR(uint8, AUTOMATIC) u8LeftChannel;
#endif
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChannelCount;
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */

    /* Get the group configuration */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);

    /* Limit checking */
    if ((Std_ReturnType)E_OK == Adc_Adc12bsarv2_CheckPartialConversion(Unit, Group, pGroupPtr->NumSamples))
    {
    /* Get the number of channel configured in group */
    #if (ADC_SETCHANNEL_API == STD_ON)
        /* Channels configured at runtime */
        ChannelCount = Adc_aRuntimeGroupChannel[Group].ChannelCount;
    #else
        /* Channels configured when initializing */
        ChannelCount = pGroupPtr->AssignedChannelCount;
    #endif
    #if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
        /* Following code will not be reduced when oneshot hardware trigger optimization is not enabled */

        /* More channels in group */
        if (Adc_aGroupStatus[Group].CurrentChannel < ChannelCount)
        {
            /* Get left channel */
            NumChannel = ChannelCount - Adc_aGroupStatus[Group].CurrentChannel;

            /* In case of left channels excess maximum allowed channels */
            u8LeftChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(NumChannel);

            /* Configure left channels and Start more conversion */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, u8LeftChannel);
        }
        /* All of channels converted */
        else
    #endif
        {
    #if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
            /* ADC080 */
            if (pGroupPtr->ExtraNotification != NULL_PTR)
            {
                /* User notification is used to update registers when using Adc_SetChannel API */
                pGroupPtr->ExtraNotification();

            }
    #endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

    #if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON)
            /* At least once the group was converted */
            Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;

            Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;

        #if (ADC_SETCHANNEL_API == STD_ON)

            /* Check if channels are updated at runtime */
            if ((boolean)TRUE == Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated)
            {
                Adc_aGroupStatus[Group].CurrentChannel = 0U;

                /* Configure left channels if needed */
                /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
                Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, pGroupPtr, (Adc_HwTriggerTimerType)pGroupPtr->pHwResource[0U], (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(ChannelCount));

                /* Reset the update status */
                Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean) FALSE;
            }
        #else

            /* Avoid compiler warning */
            (void)ChannelCount;

        #endif  /* (ADC_SETCHANNEL_API == STD_ON) */
            
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            /* Check notification of a group and call the notification function if needed */
            Adc_Adc12bsarv2_HwSwCheckNotification(Group);
            #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

    #else   /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */

            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_16();
            /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
            Adc_aGroupStatus[Group].ResultIndex++;

            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_16();
            
            /* Update state following AutoSar diagrams */
            if ((boolean)TRUE == bNormalconversion)
            {
                Adc_Adc12bsarv2_UpdateSoftwareGroupState(Unit, Group, pGroupPtr->NumSamples);
            }
        #if (ADC_HW_TRIGGER_API == STD_ON)
            else
            {
                Adc_Adc12bsarv2_UpdateHardwareGroupState(Unit, Group, pGroupPtr->NumSamples);
            }
        #endif  /* (ADC_HW_TRIGGER_API == STD_ON) */
    #endif  /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON) */
        }
    }
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    else
    {
        /* ADC448, ADC449, ADC450 */
        Adc_Adc12bsarv2_UpdateLimitCheckFailed(Unit, Group, 1U, pGroupPtr, bNormalconversion);
    }
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
    (void)bNormalconversion;
}

