xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_CheckPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
)
{
    VAR(Adc_ChannelIndexType, AUTOMATIC) CurrentChannel = Adc_aGroupStatus[Group].CurrentChannel;
    VAR(Adc_ChannelIndexType, AUTOMATIC) Temp;
    VAR(Adc_ChannelIndexType, AUTOMATIC) Index;
    VAR(uint32, AUTOMATIC) u32AdcDataValue;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;
    VAR(uint32, AUTOMATIC) u32AdcDataMask;
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResult = NULL_PTR;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    VAR(Adc_ChannelType, AUTOMATIC) HwChannel;
    VAR(boolean, AUTOMATIC) bFlag = (boolean)FALSE;
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */

    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
#endif
    /* record the result of the Channel conversion and update group status */
#if (ADC_SETCHANNEL_API == STD_ON)
    Index = Adc_aRuntimeGroupChannel[Group].ChannelCount;
#else
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    Index = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
#endif

    if(CurrentChannel <= Index)
    {
        /* Get the logical id of hardware Unit*/
        HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];

        /* Calculate the index of the first channel in the previous configuration */
        Temp = (Adc_ChannelIndexType)ADC_PRE_CHANNEL_INDEX(CurrentChannel);
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        u32AdcDataMask = Adc_pCfgPtr->pAdc[HwIndex].u32AdcDataMask;
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        pResult = Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + Adc_aGroupStatus[Group].ResultIndex;
        /* For each of channels in the list of previous configuration, read data and take result into user buffer */
        for(Index = Temp; Index < CurrentChannel; Index++)
        {
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            u32AdcDataValue = REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, ((uint32)Index - (uint32)Temp)));
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            HwChannel = Adc_pCfgPtr->pGroups[Group].pAssignment[Index];
            if ((boolean)TRUE == pGroupPtr->bAdcGroupLimitcheck)
            {
                /* ADC446, ADC447 */
                bFlag = (boolean)Adc_CheckConversionValuesInRange((uint16)u32AdcDataValue, Unit, HwChannel);
                if ((boolean)TRUE == bFlag)
                {
                    /**
                    * @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic
                    */
                    *(pResult+((Index)*(GroupSamples))) = (uint16)(u32AdcDataValue & u32AdcDataMask);
                    Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
                }
                else
                {
                    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
                    Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)TRUE;
                    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
                    return (Std_ReturnType)E_NOT_OK;
                }
            }
            else
            {
                /**
                * @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic
                */
                *(pResult + ((Index) * GroupSamples)) = (uint16)(u32AdcDataValue & u32AdcDataMask);
            }
#else
            /**
            * @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic
            */
            *(pResult + ((Index) * GroupSamples)) = (uint16)(u32AdcDataValue & u32AdcDataMask);
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
        }
    }
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
    return (Std_ReturnType)E_OK;
}

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
/**
* @brief          Check notification of a group for either hardware or software
* @details        Check notification of a group and call the notification function if needed.
*
* @param[in]      Group            The group number.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_HwSwCheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(boolean, AUTOMATIC)  bCallNotification = (boolean)FALSE;

    /* Check if notification function */
    bCallNotification = Adc_Adc12bsarv2_CheckNotification(Group);

    if ((boolean)TRUE == bCallNotification)
    {
        /* Execute notification function */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_pCfgPtr->pGroups[Group].Notification();
    }
}
#endif

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateLimitCheckFailed
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(uint8, AUTOMATIC) u8NumChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(boolean, AUTOMATIC) bNormalconversion
)
{
    if ((boolean)TRUE == bNormalconversion)
    {
        /* Group configured as one-shot mode and limit checking failed will be stop */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if (ADC_CONV_MODE_ONESHOT == pGroupPtr->eMode)
        {
            Adc_Adc12bsarv2_StopConversion(Unit);
        }
        /* Group configured as continuous will be re-configured*/
        /* ADC448 */
        else 
        {
            Adc_aGroupStatus[Group].CurrentChannel = 0U;
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, u8NumChannel);
        }
    }
}

/**
* @brief          Stop conversion of ADC hardware unit
* @details        Stop conversion of ADC hardware unit by disabling all current channels,
*                   reset interrupt mask and flags
*
* @param[in]      Group            The group number.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StopConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(uint8, AUTOMATIC) u8SCRegister;
    
    /* Disable Adc hardware unit and clear all of COCO bit by reading Rn registers */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
        
        /* ADC078 */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer. */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8SCRegister));
    }
}
#endif

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
/**
* @brief          This function restart conversion
* @details        This function restart conversion in case of streaming access mode is enabled
*
* @param[in]      Unit            ADC hardware unit
* @param[in]      Group           ADC group number
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_RestartContinuousConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(uint8, AUTOMATIC) u8NumChannel;
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChannelCount;

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get channel count in case of changing at runtime */
    ChannelCount = Adc_aRuntimeGroupChannel[Group].ChannelCount;
#else
    /* Get channel count from configuration */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    ChannelCount = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
#endif

    /* Get left channel from channel count */
    u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(ChannelCount);

