xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
    /* Incase of the number of channels in group less than the SC1 register used then update group status and start Pdb */
    if(ChannelCount <= ADC_NUM_SC1n_REGISTER_USED)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        /* Configure again Adc hardware unit in case of channels of group configured */
        if ((boolean)TRUE == Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated)
        {
            Adc_aGroupStatus[Group].CurrentChannel = 0U;

            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */

            /* Re-configure group channels and trigger PDB by software */
            Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, &(Adc_pCfgPtr->pGroups[Group]), PDB_SOFTWARE_TRIGGER_U32, u8NumChannel);

            /* Reset runtime update status */
            Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean) FALSE;
        }
        else
#endif  /* (ADC_SETCHANNEL_API == STD_ON) */
        {
            /* No need to re-configure channels if they are not changed */
            /* End of chain interrupt (if used) is still in last channel (= ChannelCount) */
            Adc_aGroupStatus[Group].CurrentChannel = ChannelCount;

            /* Trigger PDB by software */
            Adc_Pdb_StartSoftwareConversion(Unit);
        }
    }
    /* Incase of the number of channels greater than 8, re-configure Adc hardware unit for the next conversion */
    else
    {
        Adc_aGroupStatus[Group].CurrentChannel = 0U;

        /* Re-configure other segment channels of groups And start next conversion*/
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, &(Adc_pCfgPtr->pGroups[Group]), PDB_SOFTWARE_TRIGGER_U32, u8NumChannel);
    }
}

/**
* @brief          This function update state of software conversion according to AutoSar diagrams
* @details        This function update state of software conversion according to AutoSar diagrams
*                   Depending on the configuration, this function might implement other stuff include:
*                    - Start next conversion: in case of continuous conversion mode or update queue
*                    - Implement notification function (if available)
*
* @param[in]      Unit            ADC hardware unit
* @param[in]      Group           ADC group number
* @param[in]      GroupSamples    Number of samples per channel in streaming access mode
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateSoftwareGroupState
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
)
{
    /* At least once the group was converted */
    /* It's already check for validation */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;

    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_31();
    /* Change when configuration is ADC streaming access mode */
    if(ADC_BUSY == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_COMPLETED;
    }

    /* If buffer is full of samples */
    if (Adc_aGroupStatus[Group].ResultIndex >= GroupSamples)
    {
        /* Change to stream complete according to AutoSar diagram */
        Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;

        
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_31();
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if((ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode) && \
           (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) \
          )
        {
            /* Update queue and execute new start conversion request from queue if available */
            Adc_Adc12bsarv2_UpdateQueue(Unit);
            
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            /* Check user notification function and execute if available */
            Adc_Adc12bsarv2_HwSwCheckNotification(Group);
            #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
            
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
            return;
        }
        else
        {
            /* ADC_ACCESS_MODE_STREAMING && ADC_STREAM_BUFFER_CIRCULAR */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            if (ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode)
            {
                /* Restart new continuous conversion */
                Adc_aGroupStatus[Group].ResultIndex = 0U;
                Adc_Adc12bsarv2_RestartContinuousConversion(Unit, Group);
            }
            else /* (ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode) */
            {
                /* Update queue and execute new request from queue if available */
                Adc_Adc12bsarv2_UpdateQueue(Unit);
            }
        }
    }
    else
    {
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_31();
        /* Need to restart conversion until buffer is full */
        Adc_Adc12bsarv2_RestartContinuousConversion(Unit, Group);
    }

    #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* Implement user notification function if available */
    Adc_Adc12bsarv2_HwSwCheckNotification(Group);
    #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    
}

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          This function update state of hardware conversion according to AutoSar diagrams
* @details        This function update state of hardware conversion according to AutoSar diagrams
*                   Depending on the configuration, this function might implement other stuff include:
*                    - Start next conversion: in case of continuous conversion mode or update queue
*                    - Implement notification function (if available)
*
* @param[in]      Unit            ADC hardware unit
* @param[in]      Group           ADC group number
* @param[in]      GroupSamples    Number of samples per channel in streaming access mode
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateHardwareGroupState
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_StreamNumSampleType, AUTOMATIC) GroupSamples
)
{
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChannelCount;

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_aRuntimeGroupChannel[Group].ChannelCount;
#else
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    ChannelCount = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
#endif

    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_32();
    /* At least once the group was converted */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;

