xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
    if (ADC_BUSY == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_COMPLETED;
    }

    if (Adc_aGroupStatus[Group].ResultIndex >= GroupSamples)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;
        
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_32();
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if((ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode) && \
           (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode)
          )
        {
            Adc_aUnitStatus[Unit].HwNormalQueueIndex = 0U;
            
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            Adc_Adc12bsarv2_HwSwCheckNotification(Group);
            #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
            
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
            return;
        }
        Adc_aGroupStatus[Group].ResultIndex = 0U;
    }
    else
    {
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_32();
    }

    if((ChannelCount > ADC_NUM_SC1n_REGISTER_USED)
    #if (ADC_SETCHANNEL_API == STD_ON)
       || ((boolean)TRUE == Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated)
    #endif /* (ADC_SETCHANNEL_API == STD_ON) */
      )
    {
        Adc_Adc12bsarv2_StartHwTrigConversion(Unit, Group);
    }
    
    #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    Adc_Adc12bsarv2_HwSwCheckNotification(Group);
    #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    
}
#endif
#endif
#endif

#ifdef ADC_DMA_SUPPORTED
#if defined(ADC_UNIT_0) || defined(ADC_UNIT_1)
/**
* @brief          This function handles the ISR processing function for the
*                 DMA conversions.
*
* @param[in]      Unit        the current HW Unit.
*
* @return         void
*
* @api
* @implements     Adc_Adc12bsarv2_DmaEndGroupConversion_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndGroupConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Adc_GroupType, AUTOMATIC) Group = (Adc_GroupType)0;

    if(NULL_PTR != Adc_pCfgPtr)
    {

#if(STD_ON == ADC_HW_TRIGGER_API)
        if (Adc_aUnitStatus[Unit].HwNormalQueueIndex > 0U)
        {
            Group = Adc_aUnitStatus[Unit].HwNormalQueue[0];
            Adc_Adc12bsarv2_EndDmaPartialConversion(Unit, Group, (boolean)FALSE);
        }
        else
#endif
        if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > 0U)
        {
            Group = Adc_aUnitStatus[Unit].SwNormalQueue[0];
            Adc_Adc12bsarv2_EndDmaPartialConversion(Unit, Group, (boolean)TRUE);
        }
        else
        {
            /* Nothing for misra */
        }
    }
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EndDmaPartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bSoftwareConversion
)
{
#if ((ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) || ((ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON) && (ADC_SETCHANNEL_API == STD_ON)))
    VAR(Adc_ChannelIndexType, AUTOMATIC) NumChannel;
#endif
#ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
#if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
    P2VAR(Mcl_DmaTcdType, AUTOMATIC, ADC_APPL_DATA) pTcdAddress;
    VAR(Mcl_ChannelType, AUTOMATIC) DmaLinkChannel = 255U; /* Invalid DMA channel*/
#endif
#endif
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel = (Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit];

#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)

    VAR(uint16,AUTOMATIC) u16Iter;
#endif
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) || ((ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON) && ((ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) || (ADC_SETCHANNEL_API == STD_ON)))
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr;

    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
#endif

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    #if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    if((Std_ReturnType)E_OK == Adc_Adc12bsarv2_TransferToInternalBuffer(Unit, Group))
    #endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
    {
        /*Limit check passed or more channels in group */
    #if (ADC_SETCHANNEL_API == STD_ON)
        NumChannel = Adc_aRuntimeGroupChannel[Group].ChannelCount;
    #else
        NumChannel = pGroupPtr->AssignedChannelCount;
    #endif
        /* More channels in group */
        if (Adc_aGroupStatus[Group].CurrentChannel < NumChannel)
        {
            NumChannel -= Adc_aGroupStatus[Group].CurrentChannel;
            Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(NumChannel), (boolean)TRUE);
            Mcl_DmaEnableHwRequest(DmaChannel);
        }
        else
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)  */
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON)
    {
#endif
        {
    #if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
            /* ADC080 */
            if (pGroupPtr->ExtraNotification != NULL_PTR)
            {
                pGroupPtr->ExtraNotification();
            }
    #endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */
    #if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_ON)
            /* At least once the group was converted */
            Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;

            Adc_aGroupStatus[Group].eConversion=ADC_STREAM_COMPLETED;
        #if (ADC_SETCHANNEL_API == STD_ON)
            /* Configure new channel if channels of group updated */
            if ((boolean)TRUE == Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated)
            {
                Adc_aGroupStatus[Group].CurrentChannel = 0U;
                NumChannel = Adc_aRuntimeGroupChannel[Group].ChannelCount;
                /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
                Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, (Adc_HwTriggerTimerType)pGroupPtr->pHwResource[0U], (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(NumChannel), (boolean)TRUE);
                Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean) FALSE;
            }
        #endif
            /* Re-enable DMA channel after each transfer completed */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            Mcl_DmaEnableHwRequest(DmaChannel);
            
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            Adc_Adc12bsarv2_DmaCheckNotification(Group);
            #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

    #else
        #if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)
            if ((boolean) TRUE == pGroupPtr->bAdcDoubleBuffering)
            {
                Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
                
