xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
            #ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
            #if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
                if(NumChannel > 1U)
                {
                    DmaLinkChannel=(Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaDoubleBuffer[Unit];
                    pTcdAddress=Mcl_DmaGetChannelTcdAddress(DmaLinkChannel);
                    u16Iter=Mcl_DmaTcdGetIterCount(pTcdAddress);
                }
                else
            #endif
            #endif
                {
                    u16Iter=Mcl_DmaTcdGetIterCount(Adc_Adc12bsarv2_aTcdAddress[Unit]);
                }
                
                /* Update group status as ADC_COMPLETE when the haft of sample transfered and ADC_STREAM_COMPLETED when all of sample transfered  */
                if(pGroupPtr->NumSamples == u16Iter)
                {
                    Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;
                    
                    if ((ADC_ACCESS_MODE_STREAMING == pGroupPtr->eAccessMode) && \
                        (ADC_STREAM_BUFFER_LINEAR == pGroupPtr->eBufferMode) \
                       )
                    {
                        /* Stop conversion and DMA */
                        Adc_Adc12bsarv2_StopDmaAndConversion(Unit, DmaChannel);
                        
                        if(ADC_TRIGG_SRC_SW == pGroupPtr->eTriggerSource)
                        {
                            Adc_Adc12bsarv2_UpdateQueue(Unit);
                        }
                        #if (ADC_HW_TRIGGER_API == STD_ON)
                        else /* (ADC_TRIGG_SRC_HW == pGroupPtr->eTriggerSource) */
                        {
                            Adc_aUnitStatus[Unit].HwNormalQueueIndex = (Adc_QueueIndexType)0;
                        }
                        #endif /* ADC_HW_TRIGGER_API == STD_ON */
                        #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
                        Adc_Adc12bsarv2_DmaCheckNotification(Group);
                        #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
                        
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
                        return;
                    }
                #ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
                #if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
                    if(NumChannel > 1U)
                    {
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned long to pointer */
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
                        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32daddr = (uint32)Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group];
                        Mcl_DmaConfigLinkedChannel(DmaChannel,&(Adc_Adc12bsarv2_aDmaTcdConfig[Unit]), DmaLinkChannel );
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_13 cast from unsigned int to signed int */
                        Mcl_DmaTcdSetSlast(Adc_Adc12bsarv2_aTcdAddress[Unit], -(sint32)((uint32)NumChannel << 2U));
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_13 cast from unsigned int to signed int */
                        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
                        Mcl_DmaTcdSetDlast(Adc_Adc12bsarv2_aTcdAddress[Unit], -(sint32)((((uint32)Adc_pCfgPtr->pGroups[Group].NumSamples*(uint32)NumChannel)-1U)<<1));
                        
                    }
                    else
                #endif
                #endif
                    {
                        /* Start the DMA Channel in case of double buffering one channel */
                        Mcl_DmaEnableHwRequest(DmaChannel);
                    }
                }
                else
                {
                    Adc_aGroupStatus[Group].eConversion = ADC_COMPLETED;
                }
                #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
                Adc_Adc12bsarv2_DmaCheckNotification(Group);
                #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
            }
            else
        #endif
            {
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_17();
                /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
                Adc_aGroupStatus[Group].ResultIndex++;
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_17();
                if ((boolean)TRUE == bSoftwareConversion)
                {
                    Adc_Adc12bsarv2_DmaEndNormalConv(Unit, Group, DmaChannel, pGroupPtr);
                }
        #if(STD_ON == ADC_HW_TRIGGER_API)
                else
                {
                    Adc_Adc12bsarv2_DmaEndHardwareConv(Unit, Group, DmaChannel, pGroupPtr);
                }
        #endif
            }
    #endif
            (void)bSoftwareConversion;
        }
    }
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    #if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    else
    {
        /* ADC449 */
        Adc_Adc12bsarv2_UpdateDmaLimitCheckFailed(Unit, Group, DmaChannel, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32);
    }
    #endif
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
}

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaCheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(boolean, AUTOMATIC)  bCallNotification = (boolean)FALSE;

    bCallNotification = Adc_Adc12bsarv2_CheckNotification(Group);

    if ((boolean)TRUE == bCallNotification)
    {
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_pCfgPtr->pGroups[Group].Notification();
    }
}
#endif

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
/**
* @brief          This function handles the normal conversion via DMA ending.
* @details        When a normal (not injected) conversion ends, and the end of
*                 conversion DMA ISR is called, this function takes care about
*                 the driver and the module state transitions.
*
* @param[in]      Unit        the current HW Unit.
* @param[in]      Group       the handled group.
*
* @return         void
*
* @api
*
* @implements     Adc_Adc12bsarv2_DmaEndNormalConv_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndNormalConv
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr
)
{
    VAR(uint8, AUTOMATIC) u8NumChannel;

