xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
    /* At least once the group was converted */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;

    if (ADC_BUSY == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_COMPLETED;
    }

    /* If all samples completed, wrap to 0 */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if (Adc_aGroupStatus[Group].ResultIndex >= pGroupPtr->NumSamples)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if ((ADC_STREAM_BUFFER_LINEAR == pGroupPtr->eBufferMode) && \
            (ADC_ACCESS_MODE_STREAMING == pGroupPtr->eAccessMode) \
           )
        {
            Adc_Adc12bsarv2_StopDmaAndConversion(Unit, DmaChannel);

            Adc_Adc12bsarv2_UpdateQueue(Unit);

            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            Adc_Adc12bsarv2_DmaCheckNotification(Group);
            #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
            
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
            return;
        }
        Adc_aGroupStatus[Group].ResultIndex = 0U;
    }
    /* If group configured as one-shot mode then stop and update as ADC_STREAM_COMPLETED else re-configure for the next converstion */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if (ADC_CONV_MODE_CONTINUOUS == pGroupPtr->eMode)
    {
    #if (ADC_SETCHANNEL_API == STD_ON)
        u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(Adc_aRuntimeGroupChannel[Group].ChannelCount);
    #else
        u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(pGroupPtr->AssignedChannelCount);
    #endif
        Adc_aGroupStatus[Group].CurrentChannel = 0U;
        Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, u8NumChannel, (boolean)TRUE);

        /* Start the DMA Channel */
        Mcl_DmaEnableHwRequest(DmaChannel);
        #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        Adc_Adc12bsarv2_DmaCheckNotification(Group);
        #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    }
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    else if (ADC_CONV_MODE_ONESHOT == pGroupPtr->eMode)
    {
        Adc_Adc12bsarv2_StopDmaAndConversion(Unit, DmaChannel);

        Adc_aGroupStatus[Group].eConversion = ADC_STREAM_COMPLETED;

        Adc_Adc12bsarv2_UpdateQueue(Unit);

        #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        Adc_Adc12bsarv2_DmaCheckNotification(Group);
        #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    }
    else
    {
        /* Nothing for misra */
    }
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StopDmaAndConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel
)
{
    VAR(uint8, AUTOMATIC) u8SCRegister;

    /* Disable Adc hardware unit and clear all of COCO bit by reading Rn registers */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
        
        /* ADC078 */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer. */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8SCRegister));
    }

    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((uint8)STD_ON == Adc_pCfgPtr->Misc.au8Adc_HwUnit[Unit])
    {
        Mcl_DmaDisableHwRequest(DmaChannel);
    #if (MCL_DMA_NOTIFICATION_SUPPORTED == STD_ON)
        Mcl_DmaDisableNotification(DmaChannel);
    #endif
    }
}

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          This function handles the normal conversion via DMA ending.
* @details        When a normal (not injected) conversion ends, and the end of
*                 conversion DMA ISR is called, this function takes care about
*                 the driver and the module state transitions.
*
* @param[in]      Unit        the current HW Unit.
* @param[in]      Group       the handled group.
*
* @return         void
*
* @api
*
* @implements     Adc_Adc12bsarv2_DmaEndHardwareConv_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaEndHardwareConv
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr
)
{
    VAR(uint8, AUTOMATIC) u8NumChannel;
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChannelCount;

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_aRuntimeGroupChannel[Group].ChannelCount;
#else
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    ChannelCount = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
#endif
    /* At least once the group was converted */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
    /* Update ADC for first channel in group */
    Adc_aGroupStatus[Group].CurrentChannel = 0U;
    if (ADC_BUSY == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_COMPLETED;
    }
    /* If all samples completed, wrap to 0 */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if (Adc_aGroupStatus[Group].ResultIndex >= pGroupPtr->NumSamples)
    {
        Adc_aGroupStatus[Group].eConversion=ADC_STREAM_COMPLETED;
        Adc_aGroupStatus[Group].ResultIndex = 0U;
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if ((ADC_ACCESS_MODE_STREAMING == pGroupPtr->eAccessMode) && \
            (ADC_STREAM_BUFFER_LINEAR == pGroupPtr->eBufferMode) \
           )
        {
            /* Stop conversion and DMA*/
            Adc_Adc12bsarv2_StopDmaAndConversion(Unit, DmaChannel);

            Adc_aUnitStatus[Unit].HwNormalQueueIndex = (Adc_QueueIndexType)0;
            
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            Adc_Adc12bsarv2_DmaCheckNotification(Group);
            #endif /* (ADC_SETCHANNEL_API == STD_ON) */
            
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_4 Return statement before end of function. */
            return;
        }
    }
    if((ChannelCount > ADC_NUM_SC1n_REGISTER_USED)
    #if (ADC_SETCHANNEL_API == STD_ON)
       || ((boolean)TRUE == Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated)
    #endif /* (ADC_SETCHANNEL_API == STD_ON) */
      )
    {
        u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(ChannelCount);
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, (Adc_HwTriggerTimerType)pGroupPtr->pHwResource[0], u8NumChannel, (boolean)TRUE);
        #if (ADC_SETCHANNEL_API == STD_ON)
        Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean)FALSE;
        #endif /* (ADC_SETCHANNEL_API == STD_ON) */
        Adc_Adc12bsarv2_DmaUpdateDaddr(Group);
    }
    else
    {
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32saddr = (uint32)ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)0);
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer. */
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32daddr = (uint32)(Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + Adc_aGroupStatus[Group].ResultIndex);
        Mcl_DmaConfigTcd(Adc_Adc12bsarv2_aTcdAddress[Unit], &(Adc_Adc12bsarv2_aDmaTcdConfig[Unit]));
        Mcl_DmaTcdSetFlags(Adc_Adc12bsarv2_aTcdAddress[Unit], (uint8)(DMA_TCD_DISABLE_REQ_U8 | DMA_TCD_INT_MAJOR_U8));
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_02();
        Adc_aGroupStatus[Group].CurrentChannel += ChannelCount;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_02();
    }

    Mcl_DmaEnableHwRequest(DmaChannel);
    #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    Adc_Adc12bsarv2_DmaCheckNotification(Group);
    #endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    
