xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaUpdateDaddr
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResult = NULL_PTR;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */

    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    if ((boolean)FALSE == pGroupPtr->bAdcGroupLimitcheck)
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
    {
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        pResult = Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + Adc_aGroupStatus[Group].ResultIndex;
        /* Configure the destination result address in TCD of the DMA channels */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
        /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        /** Compiler_Warning : It is intended for the address of the element to be passed
        to the function as an unsigned integer*/
        Mcl_DmaTcdSetDaddr(Adc_Adc12bsarv2_aTcdAddress[Unit], (uint32)pResult);
    }
}
#endif
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
LOCAL_INLINE FUNC (Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_TransferToInternalBuffer
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Adc_ChannelType, AUTOMATIC) ChIndex;
    VAR(Std_ReturnType, AUTOMATIC) ReadGroupRet = (Std_ReturnType)E_OK;
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResult = NULL_PTR;
    VAR(boolean, AUTOMATIC) bFlag = (boolean)TRUE;
    VAR(uint16, AUTOMATIC) u16ResultValue;

    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */

    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pResult = Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + (Adc_aGroupStatus[Group].ResultIndex);
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    ChIndex = Adc_pCfgPtr->pGroups[Group].pAssignment[0];
    if ((boolean)TRUE == pGroupPtr->bAdcGroupLimitcheck)
    {
        /* Get the result value from internal buffer */
        u16ResultValue = Adc_Adc12bsarv2_aDmaInternalResultBuffer[Unit];
        /* ADC446, ADC447 */
        (bFlag) = (boolean)Adc_CheckConversionValuesInRange(u16ResultValue,Unit,ChIndex);
        if((boolean)FALSE==(bFlag))
        {
            Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;
            Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)TRUE;
        }
        else
        {
            Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
            *(pResult) = u16ResultValue;
        }
    }

    return ReadGroupRet;
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateDmaLimitCheckFailed
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group,
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger
)
{
    /* Group with limit checking failed and one-shot mode will be stop */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if(ADC_CONV_MODE_ONESHOT == pGroupPtr->eMode)
    {
        Adc_Adc12bsarv2_StopDmaAndConversion(Unit, DmaChannel);
    }
    /* For the group configured as continuous mode */
    /* ADC448 */
    else
    {
        /* Re-configure DMA incase of limit checking failed */
        Mcl_DmaTcdSetDaddr(Adc_Adc12bsarv2_aTcdAddress[Unit], (uint32)(Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32daddr));
        Mcl_DmaTcdSetSaddr(Adc_Adc12bsarv2_aTcdAddress[Unit], (uint32)(Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32saddr));
        if ((uint8)STD_ON == Adc_pCfgPtr->Misc.au8Adc_HwUnit[Unit])
        {
            Adc_Pdb_StopConversion(Unit);
            
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_9 cast from unsigned int to pointer */
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_BIT_CLEAR32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)0), ADC12BSARV2_CONV_COMPLETE_INT_EN_U32);
            
            Mcl_DmaEnableHwRequest(DmaChannel);
            /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            Adc_Pdb_ConfigurePartialConversion(Unit, Group, pGroupPtr, Trigger, 0U, 1U);
        }
    }
}
#endif
#endif
#endif
#endif

#if ((defined(ADC_UNIT_0_ISR_USED)) || (defined(ADC_UNIT_1_ISR_USED)) || (defined(ADC_DMA_SUPPORTED)))
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
/**
* @brief          This function checks if notification function is available or not
* @details        This function checks if notification function is available or not
*
* @param[in]      Group           The ADC channel group
*
* @return         boolean         TRUE or FALSE
* @retval         TRUE            In case of notification function is available
* @retval         FALSE           In case of notification function is NOT available
*
*/
LOCAL_INLINE FUNC(boolean, ADC_CODE) Adc_Adc12bsarv2_CheckNotification
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(boolean, AUTOMATIC) bCallNotification = (boolean) FALSE;

