xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2_Irq.c
    /* ADC080, ADC083, ADC060 */
    /* If group notification enabled and notification function available, return true */
    /** @violates @ref Adc_Adc12bsarv2_Irq_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((ADC_NOTIFICATION_ENABLED == Adc_aGroupStatus[Group].eNotification) && \
        (Adc_pCfgPtr->pGroups[Group].Notification != NULL_PTR)
       )
    {
        bCallNotification = (boolean)TRUE;
    }
    return bCallNotification;
}
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
/**
* @brief          This function updates queue
* @details        This function updates queue elements after a conversion
*                   and start conversion if requests are still available in queue
*
* @param[in]      Unit         The ADC hardware unit
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_UpdateQueue
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
#if (ADC_ENABLE_QUEUING == STD_ON)
    /* Remove current request element in queue */
    Adc_RemoveFromQueue(Unit,(uint8)0U);
    if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
    {
        /* Start conversion if request elements are still available in queue */
        Adc_Adc12bsarv2_StartNormalConversion((Adc_HwUnitType)Unit);
    }
#else
    /* No element will be present in the queue */
    Adc_aUnitStatus[Unit].SwNormalQueueIndex = (Adc_QueueIndexType)0;
#endif /* ADC_ENABLE_QUEUING == STD_ON */
}
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#endif
/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

#ifdef ADC_UNIT_0_ISR_USED
/*==================================================================================================
                                          ADC HW UNIT 0
==================================================================================================*/
/**
* @brief          This function handles the ISR for the conversion done of
*                 the ADC Hardware Unit 0.
* @details        The function handles the ISR for the ADC Hardware Unit 0.
*
* @return         void
*
* @isr
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_11 External linkage.
*/
ISR(Adc_Adc12bsarv2_EndGroupConvUnit0)
{
    Adc_Adc12bsarv2_EndGroupConversion((Adc_HwUnitType)ADC_UNIT_0);

    EXIT_INTERRUPT();
}
#endif /* ADC_UNIT_0_ISR_USED */

#if defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_0)
/**
* @brief          This function handles internal ADC updates after a DMA transfer is completed.
* @details        The function is a notification called by MCL module after the transfer
*                 is completed for the ADC Hardware Unit 0.
*
* @return         void
*
* @isr
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_11 External linkage.
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaTransferComplete0()
{
    Adc_Adc12bsarv2_DmaEndGroupConversion((Adc_HwUnitType)ADC_UNIT_0);
}
#endif /* (ADC_DMA_SUPPORTED) && (ADC_UNIT_0) */

#ifdef ADC_UNIT_1_ISR_USED
/*==================================================================================================
                                          ADC HW UNIT 1
==================================================================================================*/
/**
* @brief          This function handles the ISR for the conversion done of
*                 the ADC Hardware Unit 1
* @details        The function handles the ISR for the ADC Hardware Unit 1.
*
* @return         void
*
* @isr
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_11 External linkage.
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash.
*/
ISR(Adc_Adc12bsarv2_EndGroupConvUnit1)
{
    Adc_Adc12bsarv2_EndGroupConversion((Adc_HwUnitType)ADC_UNIT_1);

    EXIT_INTERRUPT();
}
#endif /* ADC_UNIT_1_ISR_USED */

#if defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_1)
/**
* @brief          This function handles internal ADC updates after a DMA transfer is completed.
* @details        The function is a notification called by MCL module after the transfer
*                 is completed for the ADC Hardware Unit 1.
*
* @return         void
*
* @isr
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_11 External linkage.
* @violates @ref Adc_Adc12bsarv2_Irq_c_REF_7 Identifier clash.
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DmaTransferComplete1()
{
    Adc_Adc12bsarv2_DmaEndGroupConversion((Adc_HwUnitType)ADC_UNIT_1);
}
#endif /* (ADC_DMA_SUPPORTED) && (ADC_UNIT_1) */

#define ADC_STOP_SEC_CODE
/**
 * @violates @ref Adc_Adc12bsarv2_Irq_c_REF_1 only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_Irq_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
